IDEA StatiCa Open Model
ConcreteCheckResults Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Concrete Check results
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResults
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class ConcreteCheckResults
Public Class ConcreteCheckResults
public ref class ConcreteCheckResults
The ConcreteCheckResults type exposes the following members.
Constructors
Name | Description
ConcreteCheckResults
 Constructor
Top
Properties
Name | Description
CheckResults
 All results
Overall
 Overal check
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace